test_cube_case/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0022964;

boundaryField
{
    inlet
    {
        type    fixedValue;
        value   uniform 0.0022964;
    }
    outlet
    {
        type    zeroGradient;
    }
    walls
    {
        type    epsilonWallFunction;
        value   uniform 0.0022964;
    }
    surface
    {
        type    epsilonWallFunction;
        value   uniform 0.0022964;
    }
}

// ************************************************************************* //
