test_cube_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Version: 13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


scale    1;

vertices
(
    (-3.0 -2.0 -2.0)
    (6.0 -2.0 -2.0)
    (6.0 3.0 -2.0)
    (-3.0 3.0 -2.0)
    (-3.0 -2.0 3.0)
    (6.0 -2.0 3.0)
    (6.0 3.0 3.0)
    (-3.0 3.0 3.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (112 62 62) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //