test_cube_case/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Version: 13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap true;
addLayers false;
geometry
{
    surface.stl
    {
        type triSurfaceMesh;
        name surface;

    }

}
castellatedMeshControls
{
    maxLocalCells 2000000;
    maxGlobalCells 20000000;
    minRefinementCells 10;
    nCellsBetweenLevels 3;
    resolveFeatureAngle 150.0;
    locationInMesh (-2.5 0.5 0.5);
    features
    (
        { file "surface.eMesh"; level 2; }
    );
    refinementSurfaces
    {
        surface
        {
            level (3 4);

        }

    }
    refinementRegions
    {


    }
    allowFreeStandingZoneFaces true;

}
snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 5;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;

}
addLayersControls
{
    relativeSizes true;
    layers
    {
        surface
        {
            nSurfaceLayers 0;

        }

    }
    firstLayerThickness 0.0;
    expansionRatio 1.2;
    minThickness 0.1;
    featureAngle 130.0;
    maxFaceThicknessRatio 0.5;
    nGrow 0;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    nRelaxIter 5;
    nLayerIter 50;
    nRelaxedIter 20;
    nBufferCellsNoExtrude 0;
    minMedialAxisAngle 90;
    maxThicknessToMedialRatio 0.3;
    nMedialAxisIter 10;

}
meshQualityControls
{
    maxNonOrtho 85.0;
    maxBoundarySkewness 20;
    maxInternalSkewness 8.0;
    maxConcave 80;
    minVol 1e-30;
    minTetQuality 1e-30;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.0001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;

}
debug 0;
mergeTolerance 1e-06;
// ************************************************************************* //
